{"compress":true,"commitItems":[["ea3af0ae-0f9d-4fb3-9af8-e8fd946cf1eb",1573176108775,"[weberna.github.io](https://weberna.github.io/blog/2017/11/15/LSTM-Vanishing-Gradients.html \"A View from the Backwards Pass\")\n\nA View from the Backwards Pass\n\n#  Why LSTMs Stop Your Gradients From Vanishing: \n\nA View from the Backwards Pass\n\nNov 15, 2017\n\n##  LSTMs: The Gentle Giants\n\nOn their surface, LSTMs (and related architectures such as GRUs) seems like wonky, overly complex contraptions. Indeed, at first it seems almost sacrilegious to add these bulky accessories to our beautifully elegant [Elman-style][1] recurrent neural networks (RNNs)! However, unlike bloated software (such as Skype), this extra complexity is warranted in the case of LSTMs (also unlike Skype is the fact that LSTM/GRUs usually [work pretty well][2]). If you have read any paper that appeared around 2015-2016 that uses LSTMs you probably know that LSTMS solve the vanishing gradient problem that had plagued vanilla RNNs before hand.\n\nIf you don't already know, the vanishing gradient problem arises when, during backprop, the error signal used to train the network exponentially decreases the further you travel backwards in your network. The effect of this is that the layers closer to your input don't get trained. In the case of RNNs (which can be unrolled and thought of as feed forward networks with shared weights) this means that you don't keep track of any long term dependencies. This is kind of a bummer, since the whole point of an RNN is to keep track of long term dependencies. The situation is analogous to having a video chat application that can't handle video chats!\n\nLooking at these big pieces of machinery its hard to get a concrete understanding of exactly _why_ they solve the vanishing gradient problem. The purpose of this blog post is to <del>put it on my resume</del> give a brief explanation as to why LSTMs (and related models) solve the vanishing gradient problem. The reason _why_ is actually pretty simple, which is all the more reason to know it. If you are unfamiliar with LSTM models I would check out this [post][3].\n\n**Notation** Notation is always the pain when describing LSTMs since there are so many variables. I will list all notation here for convienence:\n\n* $E_t$=Error at time $t$, assume (E_t) is a function of output (y_t)\n* (W_R)=The recurrent set of weights (other sets of weights denoted with a different subscript)\n* (tanh, sigma)=The activation function tanh, or sigmoid\n* (h_t)=The hidden vector at time (t)\n* (C_t)=The LSTM cell state at time (t)\n* (o_t, f_t, i_t)=The LSTM output, forget, and input gates at time (t)\n* (x_t, y_t)=The input and output at time (t)\n\n**LSTM Equation Reference** Quickly, here is a little review of the LSTM equations, with the biases left off (and mostly the same notation as [Chris Olah's post][3]:\n\n* (f_t=sigma(W_f[h_{t-1},x_t]))\n* (i_t=sigma(W_i[h_{t-1},x_t]))\n* (o_t=sigma(W_o[h_{t-1},x_t]))\n* (widetilde{C}_t=tanh(W_C[h_{t-1},x_t]))\n* (C_t=f_tC_{t-1} + i_twidetilde{C}_t)\n* (h_t=o_ttanh(C_t))\n\n#  The Case of the Vanishing Gradients\n\nTo understand why LSTMs help, we need to understand the problem with vanilla RNNs. In a vanilla RNN, the hidden vector and the output is computed as such:\n\nTo do backpropagation through time to train the RNN, we need to compute the gradient of (E) with respect to (W_R). The overall error gradient is equal to the sum of the error gradients at each time step. For step (t), we can use the multivariate chain rule to derive the error gradient as:\n\nNow everything here can be computed pretty easily _except_ the term (frac{partial h_t}{partial h_i}), which needs another chain rule application to compute:\n\nNow let us look at a single one of these terms by taking the derivative of (h_{k+1}) with respect to (h_{k})(where _diag_ turns a vector into a diagonal matrix)[1][4]:\n\nThus, if we want to backpropagate through (k) timesteps, this gradient will be :\n\nAs shown in [this paper][5], if the dominant eigenvalue of the matrix (W_R) is greater than 1, the gradient explodes. If it is less than 1, the gradient vanishes.[2][6] The fact that this equation leads to either vanishing or exploding gradients should make intuitive sense. Note that the values of (f'(x)) will always be less than 1. So if the magnitude of the values of (W_R) are too small, then inevitably the derivative will go to 0. The repeated multiplications of values less than one would overpower the repeated multiplications of (W_R). On the contrary, make (W_R) _too_ big and the derivative will go to infinity since the exponentiation of (W_R) will overpower the repeated multiplication of the values less than 1. In practice, the vanishing gradient is more common, so we will mostly focus on that.\n\nThe derivative (frac{partial h_{k}}{partial h_1}) is essentially telling us how much our hidden state at time (k) will change when we change the hidden state at time 1 by a little bit. According to the above math, if the gradient vanishes it means the earlier hidden states have no real effect on the later hidden states, meaning no long term dependencies are learned! This can be formally proved, and has been in [many papers][5], including the [original LSTM paper][7].\n\n#  Preventing Vanishing Gradients with LSTMs\n\nAs we can see above, the biggest culprit in causing our gradients to vanish is that dastardly recursive derivative we need to compute: (frac{partial h_t}{partial h_i}). If only this derivative was 'well behaved' (that is, it doesn't go to 0 or infinity as we backpropagate through layers) then we could learn long term dependencies!\n\n**The original LSTM solution** The original motivation behind the LSTM was to make this recursive derivative have a constant value. If this is the case then our gradients would neither explode or vanish. How is this accomplished? As you may know, the LSTM introduces a separate cell state (C_t). In the original 1997 LSTM, the value for (C_t) depends on the previous value of the cell state and an update term weighted by the input gate value (for motivation on why the input/output gates are needed, I would check out [this great post][8]):\n\nThis formulation doesn't work well because the cell state tends to grow uncontrollably. In order to prevent this unbounded growth, a [forget gate was added][9] to scale the previous cell state, leading to the more modern formulation:\n\n**A common misconception** Most explanations for why LSTMs solve the vanishing gradient state that under this update rule, the recursive derivative is equal to 1 (in the case of the original LSTM) or (f) (in the case of the modern LSTM)[3][10] and is thus well behaved! One thing that is often forgotten is that (f), (i), and (widetilde{C}_t) are all functions of (C_t), and thus we must take them into consideration when calculating the gradient.\n\nThe reason for this misconception is pretty reasonable. In the original LSTM formulation in 1997, the recursive gradient actually was equal to 1. The reason for this is because, in order to enforce this constant error flow, the gradient calculation was truncated so as not to flow back to the input or candidate gates. So with respect to (C_{t-1}) they could be treated as constants. Here what they say in the [original paper][7]:\n\n> However,to ensure non-decaying error backprop through internal states of memory cells, as with truncated BPTT (e.g.,Williams and Peng 1990), errors arriving at \"memory cell net inputs\" [the cell output, input, forget, and candidate gates] …do not get propagated back further in time (although they do serve to change the incoming weights).Only within memory cells [the cell state],errors are propagated back through previous internal states.\n\nIn fact truncating the gradients in this way was done up till about 2005, until the publication of [this paper][11] by Alex Graves. Since most popular neural network frameworks now do auto differentiation, its likely that you are using the full LSTM gradient formulation too! So, does the above argument about why LSTMs solve the vanishing gradient change when using the full gradient? The answer is no, actually it remains mostly the same. It just gets a bit messier.\n\n**Looking at the full LSTM gradient[**4][12] To understand why nothing really changes when using the full gradient, we need to look at what happens to the recursive gradient when we take the full gradient. As we stated before, the recursive derivative is the main thing that is causing the vanishing gradient, so lets expand out the full derivative for (frac{partial C_t}{partial C_{t-1}}). First recall that in the LSTM, (C_t) is a function of (f_t) (the forget gate), (i_t) (the input gate), and (widetilde{C}_t) (the candidate cell state), each of these being a function of (C_{t-1}) (since they are all functions of (h_{t-1})). Via the multivariate chain rule we get:\n\nNow lets explicitly write out these derivatives:\n\nNow if we want to backpropagate back (k) time steps, we simply multiply terms in the form of the one above (k) times. Note the big difference between this recursive gradient and the one for vanilla RNNs. In vanilla RNNs, the terms (frac{partial h_t}{partial h_{t-1}}) will eventually take on a values that are either always above 1 or always in the range ([0,1]), this is essentially what leads to the vanishing/exploding gradient problem. The terms here, (frac{partial C_t}{partial C_{t-1}}), _at any time step_ can take on either values that are greater than 1 or values in the range ([0,1]). Thus if we extend to an infinite amount of time steps, it is not guarenteed that we will end up converging to 0 or infinity (unlike in vanilla RNNs). If we start to converge to zero, we can always set the values of (f_t) (and other gate values) to be higher in order to bring the value of (frac{partial C_t}{partial C_{t-1}}) closer to 1, thus preventing the gradients from vanishing (or at the very least, preventing them from vanishing _too_ quickly). One important thing to note is that the values (f_t), (o_t), (i_t), and (widetilde{C}_t) are things that the network _learns_ to set (conditioned on the current input and hidden state). Thus, in this way the network learns to decide _when_ to let the gradient vanish, and _when_ to preserve it, by setting the gate values accordingly!\n\nThis might all seem magical, but it really is just the result of two main things:\n\n* The additive update function for the cell state gives a derivative thats much more 'well behaved'\n* The gating functions allow the network to decide how much the gradient vanishes, and can take on different values at each time step. The values that they take on are learned functions of the current input and hidden state.\n\nAnd that is essentially it. It is good to know that truncating the gradient (as done in the original LSTM) is not too integral to explaining why the LSTM can prevent the vanishing gradient. As we see, the arguments for why it prevents the vanishing gradient remain somewhat similar even when taking the full gradient into account. Thanks for <del>reading</del> <del>skimming</del> scrolling to the bottom to look at the comments.\n\nPlease enable JavaScript to view the [comments powered by Disqus.][13]\n\n[1]: https://tatar.ucsd.edu/jeffelman/\n[2]: http://karpathy.github.io/2015/05/21/rnn-effectiveness/\n[3]: http://colah.github.io/posts/2015-08-Understanding-LSTMs/\n[4]: https://weberna.github.io#fn%3A1\n[5]: https://arxiv.org/pdf/1211.5063.pdf\n[6]: https://weberna.github.io#fn%3A4\n[7]: http://www.bioinf.jku.at/publications/older/2604.pdf\n[8]: https://r2rt.com/written-memories-understanding-deriving-and-extending-the-lstm.html\n[9]: https://pdfs.semanticscholar.org/1154/0131eae85b2e11d53df7f1360eeb6476e7f4.pdf\n[10]: https://weberna.github.io#fn%3A2\n[11]: ftp://ftp.idsia.ch/pub/juergen/nn_2005.pdf\n[12]: https://weberna.github.io#fn%3A3\n[13]: https://disqus.com/?ref_noscript\n\n",[[1573176064153,["xueni@Ninas-MacBook-Pro.local",[[-1,127,"A View from the Backwards Pass\n"]],[127,158],[127,127]]],[1573176067361,["xueni@Ninas-MacBook-Pro.local",[[-1,127,"\n"]],[127,127],[126,126]]],[1573176071867,["xueni@Ninas-MacBook-Pro.local",[[-1,174,": "]],[176,176],[174,174]]],[1573176089486,["xueni@Ninas-MacBook-Pro.local",[[-1,2186,"("]],[2187,2187],[2186,2186]]],[1573176090366,["xueni@Ninas-MacBook-Pro.local",[[1,2186,"$"]],[2186,2186],[2187,2187]]],[1573176091924,["xueni@Ninas-MacBook-Pro.local",[[-1,2190,")"]],[2191,2191],[2190,2190]]],[1573176092477,["xueni@Ninas-MacBook-Pro.local",[[1,2190,"$"]],[2190,2190],[2191,2191]]],[1573176094770,["xueni@Ninas-MacBook-Pro.local",[[-1,2216,"("]],[2217,2217],[2216,2216]]],[1573176095268,["xueni@Ninas-MacBook-Pro.local",[[1,2216,"$"]],[2216,2216],[2217,2217]]],[1573176096797,["xueni@Ninas-MacBook-Pro.local",[[-1,2220,")"]],[2221,2221],[2220,2220]]],[1573176097339,["xueni@Ninas-MacBook-Pro.local",[[1,2220,"$"]],[2220,2220],[2221,2221]]],[1573176099618,["xueni@Ninas-MacBook-Pro.local",[[1,2159," "]],[2159,2159],[2160,2160]]],[1573176100614,["xueni@Ninas-MacBook-Pro.local",[[1,2161," "]],[2161,2161],[2162,2162]]],[1573176106944,["xueni@Ninas-MacBook-Pro.local",[[1,2156,"\\"]],[2156,2156],[2157,2157]]],[1573176118026,["xueni@Ninas-MacBook-Pro.local",[[-1,2156,"\\"]],[2157,2157],[2156,2156]]],[1573176119614,["xueni@Ninas-MacBook-Pro.local",[[1,2154,"\\"]],[2154,2154],[2155,2155]]],[1573176120531,["xueni@Ninas-MacBook-Pro.local",[[-1,2154,"\\"]],[2155,2155],[2154,2154]]],[1573176126397,["xueni@Ninas-MacBook-Pro.local",[[1,2190,"\\"]],[2190,2190],[2191,2191]]],[1573176127918,["xueni@Ninas-MacBook-Pro.local",[[-1,2190,"\\"]],[2191,2191],[2190,2190]]],[1573176128909,["xueni@Ninas-MacBook-Pro.local",[[1,2190," \\"]],[2190,2190],[2192,2192]]],[1573176129610,["xueni@Ninas-MacBook-Pro.local",[[-1,2190," \\"]],[2192,2192],[2190,2190]]],[1573176139582,["xueni@Ninas-MacBook-Pro.local",[[1,2223,"_"]],[2223,2223],[2224,2224]]],[1573176141150,["xueni@Ninas-MacBook-Pro.local",[[-1,2223,"_"]],[2224,2224],[2223,2223]]],[1573176145849,["xueni@Ninas-MacBook-Pro.local",[[1,2219,"\\"]],[2219,2219],[2220,2220]]],[1573176147120,["xueni@Ninas-MacBook-Pro.local",[[-1,2219,"\\"]],[2220,2220],[2219,2219]]],[1573176148920,["xueni@Ninas-MacBook-Pro.local",[[1,2220,"\\"]],[2220,2220],[2221,2221]]],[1573176149502,["xueni@Ninas-MacBook-Pro.local",[[-1,2220,"\\"]],[2221,2221],[2220,2220]]],[1573176151662,["xueni@Ninas-MacBook-Pro.local",[[1,2190,"\\"]],[2190,2190],[2191,2191]]],[1573176153531,["xueni@Ninas-MacBook-Pro.local",[[-1,2190,"\\"]],[2191,2191],[2190,2190]]],[1573176156072,["xueni@Ninas-MacBook-Pro.local",[[-1,2226,"("]],[2227,2227],[2226,2226]]],[1573176157125,["xueni@Ninas-MacBook-Pro.local",[[1,2226,"$"]],[2226,2226],[2227,2227]]],[1573176158600,["xueni@Ninas-MacBook-Pro.local",[[-1,2230,")"]],[2231,2231],[2230,2230]]],[1573176159196,["xueni@Ninas-MacBook-Pro.local",[[1,2230,"$"]],[2230,2230],[2231,2231]]]],null,"xueni@Ninas-MacBook-Pro.local"]]}